duplication in DataFrames

In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'key1':['A']*2 + ['B']*3,
                   'key2':[2,2,2,3,3]})
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [3]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [4]:
# to drop or get rid of duplicates in a table :

In [5]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [6]:
# to specify a certain column to drop duplicates :

In [7]:
dframe.drop_duplicates(['key2'])

  key1  key2
0    A     2
3    B     3

In [8]:
dframe.replace()

C:\Users\HP\AppData\Local\Temp\ipykernel_8840\3130953294.py:1: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  dframe.replace()

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [9]:
dframe.drop_duplicates(['key1'], take_last= True)

TypeError: DataFrame.drop_duplicates() got an unexpected keyword argument 'take_last'

In [ ]:
# mapping

In [ ]:
dframee = DataFrame({'city': ['Port Harcourt','Abuja','calabar'],
                    'Altitude': [9000,8000,4000]})
dframee

In [ ]:
state_map = {'Port Harcourt':'Rivers',
            'Abuja':'FCT',
            'calabar':'Cross-river'}

In [ ]:
dframee['State'] = dframee['city'].map(state_map) 
dframee

on replacing

In [ ]:
ser1 = Series([1,2,3,4,56,4,6,5,6,7,8,99,4,3,0])
ser1

In [ ]:
ser1.replace(6,100)

In [ ]:
ser1.replace({4:np.nan})

In [ ]:
dframek = DataFrame(np.arange(12).reshape(3,4),
                   index = ['Patient1','Patient2','Patient3'],
                   columns = ['AdmitNo','Name','Adress','CallNo'])
dframek

In [ ]:
dframek.index.array.map(str.lower)

In [ ]:
dframek.index = dframek.index.map(str.lower)
dframek

In [ ]:
# there's a problem with the above code update : fixed!

In [ ]:
#below we learn how to rename a dataframe

In [ ]:
dframek.rename(index=str.title,columns=str.upper)

In [ ]:
dframek.rename(index = {'patient1': 'Maryann '},
                      columns = {'AdmitNo':'YourNo'})

In [ ]:
# on Binning

In [ ]:
years = [1990,1991,1992,2008,2012,2015,1987,1969,2013,2008,1999]

In [ ]:
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [10]:
dacade_cat = pd.cut(years,decade_bins)
decade_cat

NameError: name 'years' is not defined